package com.shiju.homework;

/**
 * 1. 能够说出xml 的使用场景
 * 用作存储数据或者数据传输;作为软件的配置文件.
 *
 * 2. 能够说出 xml 的 DOM编程思想
 * DOM编程思想:将xml文件全部加载到内存,在内存中形成一个树形结构,然后再获取对应的值.
 *
 * 4. 能够说出 DTD 和 schema 的作用
 * 单独约束文档,根据约束编写xml文件.
 *
 * 5. 枚举的定义, 知道的枚举的使用场景
 * 	定义格式:
 * 	public enum Season{
 *     SPRING,SUMMER,AUTUMN,WINTER;
 *        }
 * 	使用场景:当一个类的对象是已知而且固定的,就可以将这个类定义为枚举类.
 *
 * 6. 如何通过 反射来 拿到 类 的 方法, 并且让 方法 跑起来
 * 	1.通过类加载器获取到类的class对象;
 * 	2.通过调用class类下的静态方法获取到成员方法;
 * 	3.通过获取到的class对象创建对象;
 * 	4.用创建的对象来调用获取到的方法,如果是非public修饰的方法,需要先取消检查后再执行.
 */

/**
 * @author shiju
 * @date 2021/04/13 09:23
 **/
public class work {
}
